# leetcode 刷题记录

会有SQL和python两个版本

## 排序相关

### 177 第N高的薪水

解题思路：首先对薪水去重，按照薪水从高到低排序，返回第N高的薪水

In [47]:
import pandas as pd
emploee=pd.DataFrame({'id':[1,2,3,4,5],
                     'salary':[100,200,300,500,500]})
emploee

   id  salary
0   1     100
1   2     200
2   3     300
3   4     500
4   5     500

In [49]:
salary=emploee[['salary']]
salary

   salary
0     100
1     200
2     300
3     500
4     500

In [51]:
salary_1=salary.drop_duplicates().sort_values(by='salary',ascending=False)
salary_1

   salary
3     500
2     300
1     200
0     100

In [55]:
salary_1.head(2).tail(1) or null

ValueError: The truth value of a DataFrame is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [59]:
import numpy as np
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                    'data1' : np.random.randn(5),
                    'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.453781 -1.082854
1    a  two  0.927843 -0.160092
2    b  one -0.765154  0.948836
3    b  two  1.712938 -1.387025
4    a  one -0.673845  0.994316

In [61]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states, years]).mean()

California  2005    0.927843
            2006   -0.765154
Ohio        2005    1.083360
            2006   -0.673845
Name: data1, dtype: float64

In [63]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.453781 -1.082854
1    a  two  0.927843 -0.160092
4    a  one -0.673845  0.994316
b
  key1 key2     data1     data2
2    b  one -0.765154  0.948836
3    b  two  1.712938 -1.387025

In [65]:
df.groupby('key1')['data1']
df.groupby('key1')[['data2']]